In [3]:
import pandas as pd
import numpy as np
from numpy.random import randn

import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

import statsmodels.formula.api as smf
from statsmodels.api import qqplot, add_constant
from statsmodels.stats.outliers_influence import variance_inflation_factor
from statsmodels.stats.proportion import proportions_ztest

import graphviz
from sklearn.impute import SimpleImputer
from sklearn.linear_model import LinearRegression, Ridge, Lasso, ElasticNet
from sklearn.tree import export_graphviz
from sklearn.tree import DecisionTreeRegressor
from sklearn.ensemble import RandomForestRegressor
from sklearn.ensemble import GradientBoostingRegressor
from sklearn.model_selection import train_test_split
from sklearn.model_selection import GridSearchCV
from sklearn.feature_selection import RFE

from sklearn.preprocessing import StandardScaler, MinMaxScaler, RobustScaler
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score, mean_absolute_percentage_error

import warnings
warnings.filterwarnings('ignore')

matplotlib.rc('font', family = 'NanumBarunGothic')
matplotlib.rc('axes', unicode_minus = False)

In [27]:
df = pd.read_csv("/home/piai/청년아카데미/01 실습파일/2. Big Data 분석/Car.csv", encoding = 'euc-kr')
df.head(1)

,Name,Location,Price,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price
0,Maruti Wagon R LXI CNG,Mumbai,2682.68,2010,72000,CNG,Manual,First,26.6 kmpl,998 CC,58.16 bhp,5.0,NaN

In [13]:
df1 = df.isnull().sum()
df1

# 원본 결측치 --> New_Price / Price / Seats / Engine / Power / Mileage

Name                    0
Location                0
Price                1053
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 46
Power                  46
Seats                  53
New_Price            6247
dtype: int64

In [66]:
df_remove = pd.read_csv("/home/piai/다운로드/NewCar.csv", encoding = 'euc-kr')
df_remove.head(1)

,Name,Location,Price,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Owner_Type_Num,Location_income,Car_cate,Brand,Brand_Category,Price_log,Power_log
0,Maruti Wagon R LXI CNG,Mumbai,2682.68,14,72000,CNG,Manual,First,26.6,998.0,58.16,5.0,1,High,Standard Car,Maruti,Economy,7.894572,4.063198

In [40]:
df_remove1 = df_remove.isnull().sum()
df_remove1

# 예인수정본 결측치 --> 마무리!

Name                 0
Location             0
Price                0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
Owner_Type_Num       0
Location_income      0
Car_cate             0
Brand                0
Brand_Category       0
Price_log            0
Power_log            0
dtype: int64

In [ ]:
# df = 원본 파일
# df_remove = 예인이가 이상치 한번 제거한 상태 ( 08.09 10:00 )

### New_Price 이상치 --> Great

In [64]:
# 열 제거 --> 이상치 X

### Seats 이상치 --> Great

In [6]:
Seats_rank = df['Seats'].value_counts().sort_values(ascending = False)
Seats_rank

# 이상치 --> 데이터 모두 2~10 인승 / 0.0 --> 1개 (4001) --> 예인이가 이미 지움.
# 혹시 몰라서 9~10 인승 이상치일까해서 차종 검색해봤는데 이상치 X

5.0     6047
7.0      796
8.0      170
4.0      119
6.0       38
2.0       18
10.0       8
9.0        3
0.0        1
Name: Seats, dtype: int64

### Location 이상치 --> Great

In [15]:
Location_rank = df['Location'].value_counts().sort_values(ascending = False)
Location_rank

# 이상치 X

Mumbai        949
Hyderabad     876
Coimbatore    772
Kochi         772
Pune          765
Delhi         660
Kolkata       654
Chennai       591
Jaipur        499
Bangalore     440
Ahmedabad     275
Name: Location, dtype: int64

### Year 이상치 --> Great

In [20]:
Year_rank = df['Year'].value_counts().sort_values(ascending = False)
Year_rank

# 2022년 데이터 

# IQR 방법 --> Q3 - Q1,   Q1 - 1.5 * IQR 보다 작거나 Q3 + 1.5 * IQR --> 58개
# 1996~2003년 58개 
# 하지만 --> 인도 최대 중고차 플랫폼중 하나인 CraTrade.com에서 데이터중 가장 낮은 1996년 차가 있었다. 그러므로 그 위는 안짜른다.
# 결론 : 이상치 X

2015    929
2014    925
2016    886
2013    791
2017    709
2012    690
2011    579
2010    407
2018    361
2009    252
2008    207
2007    148
2019    119
2006     89
2005     68
2004     35
2003     20
2002     18
2001      8
2000      5
1998      4
1999      2
1996      1
Name: Year, dtype: int64

### Engine 이상치

In [ ]:
# no고급 & 4000이상 / 800이하 --> 예인 문의!

In [43]:
Engine_esc = df_remove[df_remove['Engine'] <= 800]
Engine_esc

# 800이하 확인 결과 없음!

Empty DataFrame
Columns: [Name, Location, Price, Year, Kilometers_Driven, Fuel_Type, Transmission, Owner_Type, Mileage, Engine, Power, Seats, Owner_Type_Num, Location_income, Car_cate, Brand, Brand_Category, Price_log, Power_log]
Index: []

In [37]:
Engine_rank = df['Engine'].value_counts().sort_values(ascending = False)
Engine_rank

1197 CC    732
1248 CC    610
1498 CC    370
998 CC     309
1198 CC    281
          ...
970 CC       1
5204 CC      1
2092 CC      1
1795 CC      1
1389 CC      1
Name: Engine, Length: 150, dtype: int64

### Power 이상치

In [ ]:
# no고급 & 400이상 / 60이하 --> 어떻게? --> 60이하 나옴 --> 예인 문의!!

In [49]:
Power_esc = df_remove[df_remove['Power'] <= 40]
Power_esc

,Name,Location,Price,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Owner_Type_Num,Location_income,Car_cate,Brand,Brand_Category,Price_log,Power_log
1162,Ambassador Classic Nova Diesel,Chennai,2069.5,21,80000,Diesel,Manual,Third,12.8,1489.0,35.5,5.0,3,High,Standard Car,Ambassador,Commercial/Utility,7.635062,3.569533

### Kilometers_Driven 이상치 --> Great

In [55]:
Kilometers_Driven_esc = df_remove[df_remove['Kilometers_Driven'] >= 300000]
Kilometers_Driven_esc

# 300000km 초과 이상치 잘 제거 완료 --> 이상치 제거 완료 --> 이상치 X

,Name,Location,Price,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Owner_Type_Num,Location_income,Car_cate,Brand,Brand_Category,Price_log,Power_log
3483,Tata Indigo LS,Jaipur,1532.96,16,300000,Diesel,Manual,First,17.0,1405.0,70.0,5.0,1,Low,Standard Car,Tata,Economy,7.334956,4.248495

### Price 이상치

In [36]:
Price_rank = df['Price'].value_counts().sort_values(ascending = False)
Price_rank

# 예인 문의!!

6898.32     89
8431.28     84
5365.36     82
6515.08     74
4982.12     71
            ..
13459.39     1
77659.75     1
62038.89     1
24680.66     1
7.08         1
Name: Price, Length: 1459, dtype: int64

### Fuel_Type 이상치 --> Great

In [10]:
Fuel_Type_rank = df['Fuel_Type'].value_counts().sort_values(ascending = False)
Fuel_Type_rank

# 결과값 5개가 끝 --> 이상치 X

Diesel      3852
Petrol      3325
CNG           62
LPG           12
Electric       2
Name: Fuel_Type, dtype: int64

### Transmission 이상치 --> Great

In [63]:
Transmission_rank = df['Transmission'].value_counts().sort_values(ascending = False)
Transmission_rank

# 결과값 2개가 끝 --> 이상치 X

Manual       5204
Automatic    2049
Name: Transmission, dtype: int64

### Owner_Type 이상치 --> Great

In [29]:
Owner_Type_rank = df['Owner_Type'].value_counts().sort_values(ascending = False)
Owner_Type_rank

# 결과값 4개가 끝 --> 이상치 X

First             5952
Second            1152
Third              137
Fourth & Above      12
Name: Owner_Type, dtype: int64

### Mileage 이상치

In [62]:
Mileage_T3 = df_remove.nlargest(3, 'Mileage')
Mileage_T3

# 연비 상위 3개

,Name,Location,Price,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Owner_Type_Num,Location_income,Car_cate,Brand,Brand_Category,Price_log,Power_log
1267,Maruti Wagon R CNG LXI,Pune,4537.56,11,79494,CNG,Manual,First,33.54,998.0,67.04,5.0,1,Median,Standard Car,Maruti,Economy,8.420145,4.205289
1964,Maruti Wagon R CNG LXI,Mumbai,4675.53,11,54000,CNG,Manual,First,33.54,998.0,67.04,5.0,1,High,Standard Car,Maruti,Economy,8.450098,4.205289
2259,Maruti Wagon R CNG LXI,Pune,5978.54,10,29202,CNG,Manual,First,33.54,998.0,67.04,5.0,1,Median,Standard Car,Maruti,Economy,8.695932,4.205289

In [61]:
Mileage_B3 = df_remove.nsmallest(3, 'Mileage')
Mileage_B3

# 연비 하위 3개

,Name,Location,Price,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Owner_Type_Num,Location_income,Car_cate,Brand,Brand_Category,Price_log,Power_log
5523,Lamborghini Gallardo Coupe,Delhi,183955.20,13,6500,Petrol,Automatic,Third,6.40,5204.0,560.0,2.0,3,High,Sports Car,Lamborghini,Luxury,12.122448,6.327937
5352,Porsche Panamera 2010 2013 Diesel,Delhi,110373.12,11,36400,Diesel,Automatic,First,7.50,4806.0,394.3,4.0,1,High,Sedan,Porsche,Luxury,11.611622,5.977112
142,Mercedes-Benz S Class 2005 2013 S 500,Kolkata,45988.80,14,35277,Petrol,Automatic,First,7.81,5461.0,362.9,5.0,1,Median,Standard Car,Mercedes-Benz,Luxury,10.736153,5.894127

### Name 이상치 --> Great

In [56]:
Name_unique = df['Name'].unique()
Name_unique_num = len(Name_unique)
Name_unique_num

# 범주형 변수 + 모델이름이 2041가지이므로 이상치 판단 힘듬 --> 이상치 X

2041